Олимпиада/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляВхода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Олимпиада/src/Catalogs/Пользователи/ManagerModule.bsl
Функция НайтиСоздатьПользователя(ПользовательИБ) Экспорт
	
	ПользовательСсылка = Справочники.Пользователи.НайтиПоРеквизиту("Идентификатор", ПользовательИБ.УникальныйИдентификатор);
	
	Если Не ЗначениеЗаполнено(ПользовательСсылка) Тогда
		
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательОбъект.ИмяДляВхода = ПользовательИБ.Имя;
		ПользовательОбъект.Наименование = ПользовательИБ.ПолноеИмя;
		ПользовательОбъект.Идентификатор = ПользовательИБ.УникальныйИдентификатор;
		ПользовательОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеПользователяИБ");
		ПользовательОбъект.Записать();
		
		ПользовательСсылка = ПользовательОбъект.Ссылка;
		
	КонецЕсли;
		
	Возврат ПользовательСсылка;
	
КонецФункции
